Tekla.Structures.DrawingInternal.AssociativityManager


Tekla.Structures.DrawingInternal.AssociativityManager.GridLinesId
Cache of the grid line ids in the model

Tekla.Structures.DrawingInternal.AssociativityManager.GetDimensionStartPointRules(Tekla.Structures.Drawing.StraightDimension)
Returns list of start point rules related to the dimension
dimension: The target dimension
Returns: List of rules

Tekla.Structures.DrawingInternal.AssociativityManager.GetDimensionEndPointRules(Tekla.Structures.Drawing.StraightDimension)
Returns list of end point rules related to the dimension
dimension: The target dimension
Returns: List of rules

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetAllDimensionPointAssociations(System.Int32,System.Collections.Generic.IList{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rules associating objects to the dimension points.
dimensionId: ID of the drawing dimension under consideration
rules: rules for the dimension points
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionStartPointAssociations(System.Int32,System.Collections.Generic.IList{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rules associating objects to the start point of a dimension.
dimensionId: ID of the drawing dimension under consideration
rules: rules for the dimension start point
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionEndPointAssociations(System.Int32,System.Collections.Generic.IList{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rules associating objects to the end point of a dimension.
dimensionId: ID of the drawing dimension under consideration
rules: rules for the dimension end point
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionZeroPointAssociations(System.Int32,System.Collections.Generic.IList{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rules associating objects to the zero point of the dimension set of a dimension.
dimensionId: ID of the drawing dimension under consideration
rules: rules for the dimension set zero point
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionRebarOrBoltAssociations(System.Int32,System.Collections.Generic.IList{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rebar or bolt specific rules for the dimension.
dimensionId: ID of the drawing dimension under consideration
rules: rebar or bolt rules for the dimension
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionStartPointLocation(System.Int32,System.Int32@,System.Int32@)
Retrieve the screen location of the start point of a dimension.
dimensionId: ID of the drawing dimension under consideration
screenX: the screen x location of the dimension start point
screenY: the screen y location of the dimension start point
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionEndPointLocation(System.Int32,System.Int32@,System.Int32@)
Retrieve the screen location of the end point of a dimension.
dimensionId: ID of the drawing dimension under consideration
screenX: the screen x location of the dimension end point
screenY: the screen y location of the dimension end point
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetSectionLocation(System.Int32,System.Int32@,System.Int32@)
Retrieve the screen location of a section mark.
sectionId: Id of the section mark
screenX: The X coordinate of the point
screenY: The Y coordinate of the point
Returns: True if location was found

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetViewLocation(System.Int32,System.Int32@,System.Int32@)
Retrieve the view location.
viewId: Id of the view
screenX: The X coordinate of the point
screenY: The Y coordinate of the point
Returns: True if location was found

Tekla.Structures.DrawingInternal.AssociativityManager.ConfirmViewAssociativityHide
Confirms hiding of the view associativity dialog

Tekla.Structures.DrawingInternal.AssociativityManager.TryCreateFilterDimensionRuleFromSelectedDimensions
Creates a model object filter suitable to be used in dimensioning
Returns: created filenames (.vf, .FilterDimXml, .dim)

Tekla.Structures.DrawingInternal.AssociativityManager.GetViewRules(Tekla.Structures.Identifier)
Fetches rules of a view
viewId: The identifier of the view
Returns: Object ids

Tekla.Structures.DrawingInternal.AssociativityManager.GetViewPossibleObjects(Tekla.Structures.Identifier)
Fetches possible rule objects of a view
viewId: The identifier of the view
Returns: Object ids

Tekla.Structures.DrawingInternal.AssociativityManager.SetViewPreferredRuleObject(Tekla.Structures.Identifier,System.Int32)
Sets the preferred object id for the rules of a view
viewId: The identifier of the view
preferredObjectId: The model object id of the preferred object

Tekla.Structures.DrawingInternal.AssociativityManager.SetViewPreferredRuleObjectByGuid(Tekla.Structures.Identifier,System.String)
Sets the preferred object for the view by object guid
viewId: The identifier of the view
objectGuid: The guid of the preferred object

Tekla.Structures.DrawingInternal.AssociativityManager.GetViewPreferredRuleObject(Tekla.Structures.Identifier)
Gets the currently preferred object id for the view
viewId: The identifier of the view
Returns: Id of the preferred object

Tekla.Structures.DrawingInternal.AssociativityManager.IsExperimentalAllowed
Whether experimental features are allowed or not
Returns: Allowed or not

Tekla.Structures.DrawingInternal.AssociativityManager.CollectStraightDimensionPointsAndDirection(Tekla.Structures.Drawing.StraightDimension,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.PointAssociativityRule}@,System.Int32@,System.Collections.Generic.HashSet{Tekla.Structures.DrawingInternal.AssociativityManager.Position})


Tekla.Structures.DrawingInternal.AssociativityManager.CollectStraightDimensionSetPointsAndDirection(Tekla.Structures.Drawing.StraightDimensionSet,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.PointAssociativityRule}@,System.Int32@,System.Collections.Generic.HashSet{Tekla.Structures.DrawingInternal.AssociativityManager.Position})


Tekla.Structures.DrawingInternal.AssociativityManager.CollectDimensionConnectedPoints(Tekla.Structures.Drawing.StraightDimension,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)


Tekla.Structures.DrawingInternal.AssociativityManager.CollectTargetAttributes(Tekla.Structures.Model.Model,Tekla.Structures.Identifier,Tekla.Structures.Identifier,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.FilterRuleInfo}@)


Tekla.Structures.DrawingInternal.AssociativityManager.EscapeSpecialChars(System.String)


Tekla.Structures.DrawingInternal.AssociativityManager.GetModelAttributesFolder(Tekla.Structures.Model.Model)


Tekla.Structures.DrawingInternal.AssociativityManager.DbOperation(Tekla.Structures.DrawingInternal.AssociativityCommandEnum)


Tekla.Structures.DrawingInternal.AssociativityManager.GetDimensionPointRules(System.Int32,Tekla.Structures.DrawingInternal.AssociativityCommandEnum,System.Collections.Generic.IList{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieves the associativity rules about dimension end points.
dimensionId: Id of the dimension under consideration
command: fetch associations with start point or end point
outputList: list of point rules (intersection of planes)
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.ExportDimensionAttributes(System.Int32,System.String)
Retrieves the associativity rules about dimension end points.
dimensionId: Id of the dimension under consideration
fullPathName: Full path to the .dim file to be created

Tekla.Structures.DrawingInternal.AssociativityManager.GetDrawingObjectLocation(System.Int32,Tekla.Structures.DrawingInternal.AssociativityCommandEnum,System.Int32@,System.Int32@)
Retrieves the screen location of a drawing object.
objectId: Id of the object under consideration
command: Command to specify the fetched point
screenX: The screen x location of the point
screenY: The screen y location of the point
Returns: True in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.GetPosition(Tekla.Structures.Geometry3d.Vector)
The position of the dimension set
dimSetUpDirection: the dimension set up direction
Returns: the position of the dimension set